{"status":"ok","totalResults":10,"articles":[{"source":{"id":null,"name":"Deadline"},"author":"Pete Hammond","title":"‘Your Monster’ Review: Melissa Barrera Finds Musical Ways To Scream Her Rage With Help From A Beastly Tommy Dewey","description":"Just as its female lead is letting her inner rage come bubbling to the surface, the movie, Your Monster, about this young woman is also crying out from the inside to become a full blown Broadway musical, and not just the cult midnight movie it inevitably will…","url":"http://deadline.com/2024/10/your-monster-review-melissa-barrera-finds-musical-ways-to-scream-with-help-from-beastly-tommy-dewey-1236158700/","urlToImage":"https://deadline.com/wp-content/uploads/2024/02/YOUR-MONSTER-1-Courtesy-Vertical-Photog-Will-Stone.jpg?w=1024","publishedAt":"2024-10-25T19:37:36Z","content":"Just as its female lead is letting her inner rage come bubbling to the surface, the movie, Your Monster, about this young woman is also crying out from the inside to become a full blown Broadway musi… [+4418 chars]"},{"source":{"id":null,"name":"Brit + Co"},"author":"Chloe Williams​","title":"Surprise! Scream Queen Melissa Barrera Actually Doesn’t Care About Halloween — Exclusive","description":"Melissa Barrera's Your Monster might be the perfect unconventional Halloween movie, but the actress actually isn't a huge fan of the holiday. \"I'm not a big Halloween person,\" she told me at the movie's New York premiere on October 24. \"Weirdly, I haven't dre…","url":"https://www.brit.co/melissa-barrera-your-monster-scream-interview/","urlToImage":"https://www.brit.co/media-library/melissa-barrera-your-monster-scream.jpg?id=54088333&width=1200&height=600&coordinates=0%2C26%2C0%2C174","publishedAt":"2024-10-30T16:10:09Z","content":"Melissa Barrera's Your Monster might be the perfect unconventional Halloween movie, but the actress actually isn't a huge fan of the holiday. \"I'm not a big Halloween person,\" she told me at the movi… [+6965 chars]"},{"source":{"id":null,"name":"ComicBook.com"},"author":"Patrick Cavanaugh","title":"Your Monster Filmmaker Caroline Lindy Talks the Long Road to the Big Screen","description":"Image Courtesy of Vertical Entertainment\nWriter/director Caroline Lindy’s Your Monster has gone through a number of evolutions since she first conjured the concept. The story began as a feature before she trimmed it down to a short, and even then, there were …","url":"http://comicbook.com/horror/news/your-monster-movie-interview-caroline-lindy-short-explained/","urlToImage":"https://comicbook.com/wp-content/uploads/sites/4/2024/10/your-monster-movie-melissa-barrera.jpg?resize=2000,1118","publishedAt":"2024-10-28T21:11:18Z","content":"Writer/director Caroline Lindy’s Your Monster has gone through a number of evolutions since she first conjured the concept. The story began as a feature before she trimmed it down to a short, and eve… [+3212 chars]"},{"source":{"id":null,"name":"ComicBook.com"},"author":"Patrick Cavanaugh","title":"Your Monster Stars Open Up About the Unconventional Love Story","description":"Image Courtesy of Vertical Entertainment\nHorror films have a long tradition of featuring monstrous characters who fall for beautiful women, with there being literally hundreds of different love stories that explore entirely unique dynamics. The all-new movie …","url":"http://comicbook.com/horror/news/your-monster-movie-interview-melissa-barrera-tommy-dewey/","urlToImage":"https://comicbook.com/wp-content/uploads/sites/4/2024/10/your-monster-movie-interview.jpg?resize=2000,1118","publishedAt":"2024-10-25T22:07:59Z","content":"Horror films have a long tradition of featuring monstrous characters who fall for beautiful women, with there being literally hundreds of different love stories that explore entirely unique dynamics.… [+3205 chars]"},{"source":{"id":null,"name":"ComicBook.com"},"author":"Patrick Cavanaugh","title":"Your Monster Stars Talk Playing Pivotal Roles in an Unexpected Romance","description":"Image Courtesy of Vertical Entertainment\nEven though love stories are often more grounded than bombastic cinema, that doesn’t mean that there aren’t still treacherous villains, and Your Monster is no different. While Melissa Barrera and Tommy Dewey play the l…","url":"http://comicbook.com/horror/news/your-monster-movie-interview-kayla-foster-edmund-donovan-explained/","urlToImage":"https://comicbook.com/wp-content/uploads/sites/4/2024/10/your-monster-movie-interview-1.jpg?resize=2000,1118","publishedAt":"2024-10-28T22:52:03Z","content":"Even though love stories are often more grounded than bombastic cinema, that doesn’t mean that there aren’t still treacherous villains, and Your Monster is no different. While Melissa Barrera and Tom… [+3266 chars]"},{"source":{"id":null,"name":"Deadline"},"author":"jillg366","title":"‘Memoir Of A Snail’ & ‘Conclave’ Debut; A Soft-Side-Of-Donald-Trump Doc Takes On ‘The Apprentice’ – Specialty Preview","description":"Indie releases from limited (Memoir of a Snail) to wide (Conclave) are testing an increasingly lively specialty box office heading into awards season with a handful of decorated documentaries this week including Dahomey, Black Box Diaries, My Name Is Alfred H…","url":"http://deadline.com/2024/10/indie-films-opening-memoir-of-a-snail-conclave-donald-trump-documentary-1236158741/","urlToImage":"https://deadline.com/wp-content/uploads/2024/10/Memoir-Of-A-Snail-Conclave-The-Man-You-Dont-Know-Dahomey.jpg?w=1000","publishedAt":"2024-10-25T21:40:45Z","content":"Indie releases from limited (Memoir of a Snail) to wide (Conclave) are testing an increasingly lively specialty box office heading into awards season with a handful of decorated documentaries this we… [+12535 chars]"},{"source":{"id":null,"name":"Observer"},"author":"Laura Babiak, Laura Babiak","title":"Melissa Barrera Talks Scream Queen Status and Sweater Weather in ‘Your Monster’","description":"The 'Scream' actress has made a name for herself in horror, but this new Halloween rom-com shows a different side of her, from musical talents to comedic chops.","url":"https://observer.com/2024/10/melissa-barrera-talks-scream-queen-status-and-sweater-weather-in-your-monster/","urlToImage":"https://observer.com/wp-content/uploads/sites/2/2024/10/image5-your-monster.jpg?quality=80","publishedAt":"2024-10-25T18:41:58Z","content":"Melissa Barrera stars in the horror rom-com Your Monster. Courtesy of Vertical Entertainment\r\nWith Halloween right around the corner, its the season of scary movies and all things horror. But jump sc… [+5867 chars]"},{"source":{"id":null,"name":"Decider"},"author":"mliss1578","title":"‘Your Monster’ Star Melissa Barrera Says She “Never Felt Anything Weird” About Kissing a Monster: “It Just Felt Very Natural”","description":"Barrera spoke to Decider about falling in love with a monster in her new indie horror-comedy.","url":"https://decider.com/2024/10/25/melissa-barrera-interview-your-monster-movie-ending-explained-scream-neve-campbell/","urlToImage":"https://decider.com/wp-content/uploads/2024/10/interview-Melissa-Barrera.jpg?quality=75&strip=all&w=1200","publishedAt":"2024-10-25T15:00:21Z","content":"Melissa Barrera is ready to be the new scream queen. \r\n“I have so much respect for so many iconic scream queens that have come before,” Barrera told Decider in a recent Zoom interview. “That anyone w… [+6704 chars]"},{"source":{"id":"the-times-of-india","name":"The Times of India"},"author":"The Feed","title":"Your Monster: When and where to watch the horror comedy on streaming? Release window","description":"Melissa Barrera, recognized for her rising status as a “scream queen,” stars in Your Monster, an indie horror-comedy directed by Caroline Lindy.","url":"https://economictimes.indiatimes.com/news/international/us/your-monster-when-and-where-to-watch-the-horror-comedy-on-streaming-release-window/articleshow/114590151.cms","urlToImage":"https://img.etimg.com/thumb/msid-114590252,width-1200,height-630,imgsize-9594,overlay-economictimes/articleshow.jpg","publishedAt":"2024-10-25T13:45:38Z","content":"Melissa Barrera, known for her emerging status as a scream queen, takes the lead in Your Monster, an indie horror-comedy directed by Caroline Lindy. The film is generating buzz, especially since it m… [+3330 chars]"},{"source":{"id":null,"name":"Bleeding Cool News"},"author":"Aedan Juvet","title":"Your Monster Director on the Film's Core Themes and Genre Influences","description":"The 2024 film Your Monster is described as an anti-romantic comedy-horror film written and directed by Caroline Lindy, also based on her 2019 short film of the same name. In Your Monster, Melissa Barrera takes on the role of a young actress navigating the com…","url":"https://bleedingcool.com/movies/your-monster-director-on-the-films-core-themes-and-genre-influences/","urlToImage":"https://bleedingcool.com/wp-content/uploads/2024/09/YourMonster_Teaser_Locked_Standard-Size_062824-1-2000x1125.jpg","publishedAt":"2024-11-03T22:47:08Z","content":"Posted in: Movies, News | Tagged: caroline lindy, film, vertical, Your Monster\r\nCaroline Lindy, the filmmaker behind the new film Your Monster, discusses some of the film's core themes and intentions… [+2457 chars]"}]}